// --створити масив та вивести його в консоль:
//     - з 5 числових значень
let arrNum = [1, 2, 3, 4, 5];
// - з 5 стічкових значень
let arrStr = [`a`, `b`, `c`, `d`, `e`];
// - з 5 значень стрічкового, числового та булевого типу
let arrMixType = [1, 2, `a`, `b`, true, false];
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
let emptyArr = [];
emptyArr[0] = 1;
emptyArr[1] = 2;
emptyArr[2] = 3;
emptyArr[3] = 4;
emptyArr[4] = 5;
console.log(emptyArr);
//
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
for (let i = 0; i < 10; i++) {
    document.write(`Hello `)
}

// - створити об'єкт (не меньше 5ти властивостей) який описує
// - собаку
let dog = {
    name: `Sharik`,
    gender: `boy`,
    color: `brown`,
    age: 3,
    owner: `not me`
};
// - людину
let person={
    age: 24,
    city:`Lviv`,
    name: `Oleksii`,
    secondName: `Pysmennyi`,
    country: `Ukraine`
};
// - автомобіль
let car ={
    age: 2,
    vinNumber: `1224FJ`,
    model: `kopejka`,
    owner: `my dog`,
    color: `rainbow`
};
// - квартиру
let apartment ={
    floor: 1,
    city: `Lviv`,
    owner: `not me`,
    rooms: 2,
    squareFit: 45
};
// - книгу
let book = {
    author: `not me`,
    pages: 2345,
    year: 2020,
    color: `red`,
    country: `Ukraine`
};
//
// -- Створити масив та вивести його в консоль:
//   - з 5 собак
let dogArr = [`dog1`, `dog2`, `dog3`, `dog4`, `dog5`];
console.log(dogArr);
// - 3 5 людей
let personArr = [`person1`, `person2`, `person3`, `person4`, `person5`];
console.log(personArr);
// - з 5 автомобілів
let automobileArr = [`automobile1`, `automobile2`, `automobile3`, `automobile4`, `automobile5`];
console.log(automobileArr);
// -- створити об'єкт (не меньше 5ти властивостей) який описує, одна з властивостей обов'язково повинна бути об'єктом,ще одна - масивом
// - будинок
let hous = {
    color: {
        color1: `grey`,
        color2: `blue`,
        color3: `white`
    },
    owner:[`Olha`, `Olha2`],
    apartments: 20,
    city: `Lviv`,
    age: 10
};
// - водій
let driver = {
    gender: [`male`, `female`],
    city: {
        city1: `Lviv`,
        city2: `Dnipro`
},
    age: `18-35`,
    alcoholic: `no`,
    car: `bicycle`
};
// - іграшку
let doll = {
    gender: [`male`, `female`],
    for_kids: `no`,
    expensive: `yes`,
    height: 186,
    skinColor:{
        color1: `white`,
        color2: `black`,
        color3: `yellow`,
        color4: `mix`
    }
};
// - стіл
let table = {
    height: [100, 200, 300],
    color:{
        color1: `white`,
        color2: `black`,
        color3: `yellow`,
        color4: `mix`
    },
    material:[`wood`, `metal`, `poliester`],
    locker:[`yes`, `no`],
    waterproof:{
        yes:`yes`,
        no: `no`
    }
};
// - сумка
let bag = {
    height:[30, 40, 50, `over 50`],
    color:{
        color1: `white`,
        color2: `black`,
        color3: `yellow`,
        color4: `mix`
    },
    type:[`backpag`, `purse`, `other`],
    purpose:{
        purpose1: `for work`,
        purpose2: `for city`,
        purpose3: `for hiking`,
    },
    grnder:[`male`, `female`, `other`]

};
// Дан массив:
  let users = [
    {name: 'vasya', age: 31, status: false},
    {name: 'petya', age: 30, status: true},
    {name: 'kolya', age: 29, status: true},
    {name: 'olya', age: 28, status: false},
    {name: 'max', age: 30, status: true},
    {name: 'anya', age: 31, status: false},
    {name: 'oleg', age: 28, status: false},
    {name: 'andrey', age: 29, status: true},
    {name: 'masha', age: 30, status: true},
    {name: 'olya', age: 31, status: false},
    {name: 'max', age: 31, status: true}
  ];
// - звернутися в відповідну ячейку масиву і відповідний параметр об'єкта і вивести в консольх наступне
// - статус Андрія
console.log(users[7].status);

// - статус Максима users[10].status
console.log(users[10].status);
// - ім'я передостаннього об'єкту
console.log(users[users.length-2].name);
// - ім'я третього об'єкта
console.log(users[2].name);
// - вік Олега
console.log(users[6].age);
// - вік Олі
console.log(users[users.length-2].age);
// - вік + ім'я 5го об'єкта
console.log(`${users[4].name}, ${users[4].age}`);
// - вік + сатус Анни users[9].age + ' ' + user[9].status
console.log(`${users[5].name}, ${users[5].age}, ${users[5].status}`);
// Приклад: вивести ім'я 1го об'єкта. Відповідь: console.log (users [0] .name). Будьте уважні! 4й об'єкт має індес 3!
//
// -Візьміть файл task2_template.html, підключіть до нього скрипт, і працюйте в ньому.
//
// -- Напишіть код,  який за допомоги document.getElementById або document.getElementsByClassName або document.getElementsByTagName :
// - отримує текст з параграфа з id "content"
let content = document.getElementById('content');
console.log(content.innerText);
// - замініть текст параграфа з id 'content' на будь-який інший
console.log(document.getElementById(`rules`).innerText);
// - замініть текст параграфа з id 'rules' на будь-який інший
let rules = document.getElementById(`rules`);
console.log(rules.innerText = `hell`);
// - змініть кожному елементу колір фону на червоний
content.style.backgroundColor = `red`;
rules.style.backgroundColor = `red`;
// - змініть кожному елементу колір тексту на синій
content.style.color = `blue`;
rules.style.color = `blue`;
// - отримати весь список класів елемента з  id=rules і вивести їх в console.log
console.log(rules.classList);
// - отримати всі елементи з класом fc_rules
let fc_rules = document.getElementsByClassName(`fc_rules`);
console.log(fc_rules);
// - поміняти колір тексту у всіх елементів fc_rules на червоний
for (const fc_rul of fc_rules) {
    fc_rul.style.color = `red`;
}
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
let arr = [2,17,13,6,22,31,45,66,100,-18];
// //   1. перебрати його циклом while}
let counter = 0;
while (counter < arr.length){
    console.log(arr[counter]);
    counter++;
}
// //   2. перебрати його циклом for
for (let i = 0; i < arr.length; i++) {
    console.log(arr[i]);
}
// //   3. перебрати циклом while та вивести  числа тільки з непарним індексом
while(counter<arr.length){
    if (counter%2 === 0){
        console.log(arr[counter]);
    }
    counter++;
}
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
while(counter<arr.length){
    if (counter%2 !== 0){
        console.log(arr[counter]);
    }
    counter++;
}
// 5. перебрати циклом while та вивести  числа тільки парні  значення
while (counter<arr.length){
    if (arr[counter]%2===0){
        console.log(arr[counter]);
    }
    counter++;
}
// 6. перебрати циклом for та вивести  числа тільки парні  значення
for (let i = 0; i < arr.length; i++) {
    if (arr[i]%2===0){
        console.log(arr[i]);
    }

}
// 7. замінити кожне число кратне 3 на слово "okten"
for (let i = 0; i < arr.length; i++) {
    if (arr[i]%3===0){
        arr[i]=`okten`;
    }
}
// console.log(arr);

// 8. вивести масив в зворотньому порядку.
for (let i = arr.length-1; i >=0;) {
    console.log(arr[i]);
    i--;
}
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
// створити пустий масив та :
let emptyArray = [];
//   - заповнити його 50 парними числами за допомоги циклу.
let even =2;
for (let i = 2; i < 50; i++) {
        emptyArray[i] = even;
        even +=2;
}
console.log(emptyArray);
// - заповнити його 50 непарними числами за допомоги циклу.
// 1
// створити пустий масив та :
//   1. заповнити його 50 парними числами за допомоги циклу.
// 2. заповнити його 50 непарними числами за допомоги циклу.
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//   диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// 2. вывести на консоль  каждый третий елемент
// 3. вывести на консоль  каждый третий елемент

// но при условии что его значение является парным.
// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
// 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
// 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
//
// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.


// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.
// =================
// =====class=======
// =================
// Взяти файл task2_template_2.html та працювати в ньому
// - Напишіть код, який :
// -- змінює колір тексту елемнту з ід main_header на будь-який інший +
// -- робить шириниу елементу ul 400 пікселів +
// -- робить шириниу всіх елементів з класом linkList шириною 50% +
// -- отримує текст який зберігається в елементі з класом listElement2+
// -- отримує всі елементи li та змінює ім колір фону на сірий
// -- отримує всі елементи 'a' та додає їм клас anchor
// -- отримує всі елементи 'a' та у випадку, якщо текстовий контен елементу дорівнює link3, змінює йому розмір тексту на 40 пікселів
// -- отримує всі елементи 'a' та додає їм клас element_XXX. Де XXX - текстовий контент елементу a
// -- отримує всі елементи 'sub-header' та змінює колір фону. Фон отримати з prompt()
// -- отримує всі елементи 'sub-header' та змінює колір тексту у видаку якщо текст елемнту = content 2 segment . Колір отримати з prompt()
// -- отримує елемент з класом content_1 та заміняє  в ньому тест на довільний. Текст отримати з prompt()

// -- отримати елементи p та змінити їм paddin на довільне значення
// -- отримати елементи з класом text2 та змінити їм текст на довільне значення






// __________________________________________________________________________________________________________________
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
//
// =================
// =================
// =================
// =================
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//
// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
//
// 1
// створити пустий масив та :
//     1. заповнити його 50 парними числами за допомоги циклу.
// 2. заповнити його 50 непарними числами за допомоги циклу.
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//     диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// 2. вывести на консоль  каждый третий елемент
// 3. вывести на консоль  каждый третий елемент
// но при условии что его значение является парным.
// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
// 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
// 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
//
// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.
